import streamlit as st
st.set_page_config(
    page_title="독도 역사",
    page_icon="🇰🇷",
    layout="centered"
)

# 배경 스타일 설정
st.markdown(
    """
    <style>
    @import url('https://fonts.googleapis.com/css2?family=Nanum+Myeongjo:wght@700&display=swap');
    .stApp {
        background-color: #f0f8ff;
        background-image: linear-gradient(45deg, #f0f8ff 25%, #d7e3fc 75%);
    }
    .title {
        font-family: 'Nanum Myeongjo', serif;
        font-size: 3rem;
        text-align: center;
        color: #2c3e50;
    }
    .description {
        font-size: 1.2rem;
        text-align: center;
        color: #34495E;
        margin-bottom: 20px;
    }
    </style>
    """,
    unsafe_allow_html=True
)
st.title("독도 역사")

st.header("삼국 시대")
st.write("『삼국사기』 기록에 512년 우산국이 항복하여 복속하고 해마다 토산물을 공물로 바치기로 했다는 기록이 있다. 여기서 우산국의 위치를 명주(강원도 강릉)의 정동쪽 바다에 있는 섬으로 혹은 울릉도라고 부른다고 하였다. 또 『삼국유사』에는 아슬라주(강원도 강릉)의 동쪽 바다 가운데에 순풍으로 이틀 걸리는 거리에 울릉도가 있다고 하였다. 신라의 이사부가 군대를 거느리고 울릉도 토착민을 토벌하여 울릉도가 항복함으로써 신라에 속하게 되었다.")
st.header("고려 시대")
st.write("고려시대에는 울릉도를 무릉 혹은 우릉이라고도 불렀다. 『고려사』의 기록에 의하면 울릉도가 사람이 살만한 땅인지를 알아보게 했는데 바위가 많아 살기 좋지 않다고 보고하여 그 이후 논의가 이어지지 않았다고 하였다. 또 『고려사』 지리지에는 우산·무릉이 본래 두 개의 섬으로 서로 멀지 않아 기후가 청명하면 가히 바라볼 수 있다고 기록하였다.")
st.header("조선 시대")
st.write("조선왕조실록에는 울릉도와 독도에 대한 기록이 많이 나타난다. 『태종실록』 기록에 1416년 박습이 태종에게 보고한 내용 중 울릉도 곁에 소도가 있다고 하였다. 또 『세종실록』 지리지 울진현 편에는 우산과 무릉 2섬이 현의 정동쪽 바다 가운데 있고 2섬이 서로 거리가 멀지 아니하여, 날씨가 맑으면 가히 바라볼 수 있다고 하였다.")
st.header("플러스")
st.write("1905년 일본이 러일전쟁 중에 내각 결의를 통하여 독도를 일본 영토에 편입시키고 그들의 땅이라고 주장했다. 1906년 울도군수 심흥택이 울도군 소속 독도에 일본인이 와서 조사하고 갔다는 보고서를 올리자 조선 정부에서 지령을 내려 “독도가 일본 영토라는 설은 전혀 근거가 없는 것”이라며, “독도의 형편과 일본인들의 행동을 다시 조사하여 보고하라”고 하였다. 일본이 1945년 패망한 후 연합국은 1946년 연합국 최고사령관 각서(SCAPIN) 제677호 「일본으로부터 일정 주변지역의 통치 및 행정상의 분리에 관한 각서」를 통해 일본의 영토를 정의하였는데 여기서 울릉도, 독도, 제주도는 제외한다고 되어있다. 또 각서(SCAPIN) 제1033호 「일본의 어업 및 포경업 허가 구역에 관한 각서」를 통해 일본의 선박 및 국민이 독도 또는 독도 주변 12해리 이내에 접근하는 것을 금지하였다. 일본의 패망으로 제2차 세계대전이 끝나자 전후 처리를 위하여 1951년 연합국과 일본이 샌프란시스코 강화조약을 체결하였다. 이 조약 제2조에 “일본은 한국의 독립을 인정하고 제주도, 거문도, 울릉도를 포함한 한반도와 그 부속 도서에 대한 모든 권리, 자격, 영유권을 포기한다”고 규정하였다. 그런데 처음 초안을 만들 때는 독도도 한국 땅이라는 문구가 있었는데 수정을 거치는 동안에 독도에 대한 명문이 없어지고 한반도와 부속 도서라는 글귀로 확정되었다. 이 때문에 일본에서는 이것을 근거로 독도가 자신의 땅이라고 주장하였다. 그러나 이 조약에서 명기한 제주도, 거문도, 울릉도는 우리나라의 3천여 개의 도서 가운데 예시에 불과하며, 독도가 직접적으로 명시되지 않았다고 하여 독도가 한국의 영토에 포함되지 않는다고 볼 수 없다.")
