import streamlit as st
st.set_page_config(
    page_title="독도 역사",
    page_icon="🇰🇷",
    layout="centered"
)


st.title("독도 역사")



st.header("삼국 시대")
st.write("『삼국사기』 기록에 512년 우산국이 항복하여 복속하고 해마다 토산물을 공물로 바치기로 했다는 기록이 있다. 여기서 우산국의 위치를 명주(강원도 강릉)의 정동쪽 바다에 있는 섬으로 혹은 울릉도라고 부른다고 하였다. 또 『삼국유사』에는 아슬라주(강원도 강릉)의 동쪽 바다 가운데에 순풍으로 이틀 걸리는 거리에 울릉도가 있다고 하였다. 신라의 이사부가 군대를 거느리고 울릉도 토착민을 토벌하여 울릉도가 항복함으로써 신라에 속하게 되었다.")
st.header("고려 시대")
st.write("고려시대에는 울릉도를 무릉 혹은 우릉이라고도 불렀다. 『고려사』의 기록에 의하면 울릉도가 사람이 살만한 땅인지를 알아보게 했는데 바위가 많아 살기 좋지 않다고 보고하여 그 이후 논의가 이어지지 않았다고 하였다. 또 『고려사』 지리지에는 우산·무릉이 본래 두 개의 섬으로 서로 멀지 않아 기후가 청명하면 가히 바라볼 수 있다고 기록하였다.")
st.header("조선 시대")
st.write("조선왕조실록에는 울릉도와 독도에 대한 기록이 많이 나타난다. 『태종실록』 기록에 1416년 박습이 태종에게 보고한 내용 중 울릉도 곁에 소도가 있다고 하였다. 또 『세종실록』 지리지 울진현 편에는 우산과 무릉 2섬이 현의 정동쪽 바다 가운데 있고 2섬이 서로 거리가 멀지 아니하여, 날씨가 맑으면 가히 바라볼 수 있다고 하였다.")
st.header("플러스")
st.write("1905년 일본은 러일전쟁 중 독도를 자국 영토로 편입했다고 주장했다. 1906년 울도군수 심흥택이 독도에 일본인이 조사하러 왔다고 보고하자, 조선 정부는 독도가 일본 영토라는 주장은 근거 없으며, 추가 조사를 지시했다. 1945년 일본 패망 후, 연합국은 SCAPIN 제677호에서 일본 영토에서 독도를 제외했고, SCAPIN 제1033호를 통해 일본인의 독도 접근을 금지했다. 1951년 샌프란시스코 강화조약에서 일본은 한반도와 부속 도서의 영유권을 포기했으며, 초안에는 독도가 한국 영토로 명시되었으나 최종 문구에서 빠졌다. 그러나 이는 단순한 예시일 뿐, 독도가 한국 영토에서 제외된 것으로 볼 수 없다.")
